app/Config/Login.php

SELECT *
FROM `administrators`
WHERE `id` = '1'
 LIMIT 1
---
    public function __construct(){
        $this->session = \Config\Services::session();
        $this->db      = \Config\Database::connect();
        $this->adminModel = new \App\Models\AdministratorModel();

        if($this->session->admin_id != null){
            $admin = $this->adminModel->where('id', $this->session->admin_id)->first();