app/Views/modules/buy_manage.php

                                        foreach($materials as $material){
                                            $exist = $db->table("buy_items");
                                            $exist->where("material_id", $material->id);
                                            $exist->where("buy_id", $buy->id);
---
SELECT *
FROM `buy_items`
WHERE `material_id` = '1'
AND `buy_id` = '2'