app/Views/modules/product.php

                                <td>
                                    <?php
                                    $variants = $db->table("product_variants");
                                    $variants->where("product_id",$product->id);
---
SELECT *
FROM `product_variants`
WHERE `product_id` = '4'
ORDER BY `id` ASC