app/Views/modules/production_manage.php

SELECT *
FROM `ingredients`
WHERE `material_id` = '1'
AND `production_id` = '8'
---
                                                                foreach ($materials as $material) {
                                                                    $exist = $db->table("ingredients");
                                                                    $exist->where("material_id", $material->id);
                                                                    $exist->where("production_id", $production->id);