app/Views/modules/sale_manage.php

SELECT *
FROM `sale_items`
WHERE `product_id` = '1'
AND `sale_id` = '1'
---
                                            <?php
                                            $exist_product = $db->table("sale_items");
                                            $exist_product->where("product_id", $product->id);
                                            $exist_product->where("sale_id", $sale->id);

SELECT *
FROM `product_variants`
WHERE `product_id` = '1'
---
                                            <?php
                                            $variants = $db->table("product_variants");
                                            $variants->where("product_id", $product->id);
                                            $variants = $variants->get();

SELECT *
FROM `sale_items`
WHERE `product_variant_id` = '1'
AND `sale_id` = '1'
---
                                                <?php
                                                $exist_product_variant = $db->table("sale_items");
                                                $exist_product_variant->where("product_variant_id", $variant->id);
                                                $exist_product_variant->where("sale_id", $sale->id);