app/Views/modules/sale.php

                                    $customer = $db->table("customers");
                                    $customer->select("name");
                                    $customer->where("id", $sale->customer_id);
                                    $customer = $customer->get();
---
SELECT `name`
FROM `customers`
WHERE `id` = '1'