app/Views/modules/transaction.php

SELECT *
FROM `administrators`
WHERE `id` = '1'
---
                                <?php
                                $admin = $db->table("administrators");
                                $admin->where("id", $transaction->admin_id);
                                $admin = $admin->get();