app/Views/modules/transaction.php

                                <!-- <td>
                                <?php
                                $admin = $db->table("administrators");
                                $admin->where("id", $transaction->admin_id);
                                $admin = $admin->get();
---
SELECT *
FROM `administrators`
WHERE `id` = '1'