app/Controllers/BuyController.php

SELECT *
FROM `buys`
WHERE `id` = '3'
AND `admin_id` = '1'
 LIMIT 1
---
    public function buy_manage($id){
        $buy = $this->buyModel->where("id", $id)->where("admin_id",$this->session->admin_id)->first();