app/Controllers/BuyController.php

SELECT *
FROM `buys`
WHERE `admin_id` = '1'
ORDER BY `date` DESC, `id` DESC
---
    public function buy()
    {
        $buys = $this->buyModel
            ->where("admin_id", $this->session->admin_id)
            ->orderBy("date", "desc")
            ->orderBy("id", "desc")
            ->findAll();

SELECT *
FROM `buys`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `buy_items`
WHERE `buy_id` = '7'
SELECT *
FROM `suppliers`
ORDER BY `name` ASC
SELECT *
FROM `materials`
ORDER BY `name` ASC
---
    public function buy_manage($id)
    {
        $buy = $this->buyModel->where("id", $id)->first();

        if ($buy == NULL) {
            $this->session->setFlashdata("msg_type", "error");
            $this->session->setFlashdata("msg", "<b>Gagal</b> <br> Data pembelian tidak ditemukan.");
            return redirect()->to(base_url('buy'));
        }

        $items = $this->buyItemModel->where("buy_id", $id)->findAll();
        $suppliers = $this->supplierModel->orderBy("name", "asc")->findAll();
        $materials = $this->materialModel->orderBy("name", "asc")->findAll();

UPDATE `buys` SET `supplier_id` = '2', `invoice_reference` = 'PB23131', `date` = '2022-12-27', `notes` = '-'
WHERE `id` = '7'
---
    public function buy_edit_process()
    {
        $id = $this->request->getPost("id");
        $supplier = $this->request->getPost("supplier");
        $invoice = $this->request->getPost("invoice");
        $date = $this->request->getPost("date");
        $notes = $this->request->getPost("notes");

        $this->buyModel->where("id", $id)->set([
            "supplier_id"       => $supplier,
            "invoice_reference" => $invoice,
            "date"              => $date,
            "notes"             => $notes,
        ])->update();

SELECT *
FROM `buys`
WHERE `id` = '7'
AND `admin_id` = '1'
 LIMIT 1
SELECT *
FROM `buys`
JOIN `suppliers` ON `buys`.`supplier_id` = `suppliers`.`id`
WHERE `buys`.`id` = '7'
 LIMIT 1
SELECT *
FROM `buy_items`
WHERE `buy_id` = '7'
---
    public function buy_print($buyId)
    {
        $buy = $this->buyModel->where("id", $buyId)->where("admin_id", $this->session->admin_id)->first();

        if ($buy == NULL) {
            $this->session->setFlashdata("msg_type", "error");
            $this->session->setFlashdata("msg", "<b>Gagal</b> <br> Data pembelian tidak ditemukan.");
            return redirect()->to(base_url('buy'));
        }

        $buy = $this->buyModel
            ->join('suppliers', 'buys.supplier_id = suppliers.id')
            ->where("buys.id", $buyId)
            ->first();
        $items = $this->buyItemModel->where('buy_id', $buyId)->findAll();