app/Controllers/CustomerController.php

SELECT *
FROM `customers`
ORDER BY `name` ASC
---
    public function customer(){
        $customers = $this->customerModel->orderBy("name","asc")->findAll();