app/Controllers/DashboardController.php

SELECT *
FROM `products`
SELECT *
FROM `suppliers`
SELECT *
FROM `customers`
SELECT *
FROM `sales`
ORDER BY `date` DESC, `id` DESC
 LIMIT 5
SELECT *
FROM `productions`
ORDER BY `production_date` DESC, `id` DESC
 LIMIT 5
---
    public function index()
    {
        $products = $this->productModel->findAll();
        $suppliers = $this->supplierModel->findAll();
        $customers = $this->customerModel->findAll();

        $sales = $this->saleModel->orderBy("date","desc")->orderBy("id","desc")->findAll(5,0);
        $productions = $this->ProductionModel->orderBy("production_date","desc")->orderBy("id","desc")->findAll(5,0);