app/Controllers/MaterialController.php

    public function material(){
        $materials = $this->materialModel->orderBy("name","asc")->findAll();
---
SELECT *
FROM `materials`
ORDER BY `name` ASC