app/Controllers/ProductionController.php

SELECT *
FROM `productions`
WHERE `id` = '4'
 LIMIT 1
---
            ])->update();
        }

        $this->ProductionModel->where('id', $production_id)->set([
            'product_id' => $newID,
            'admin_id' => $this->session->admin_id,
            'snapshot_product_name' => $name,
            'snapshot_product_unit' => $unit,
            'snapshot_product_price' => $price,
            'targets' => $targets,
            'achieveds' => $achieveds,
            'faileds' => $faileds,
            'production_date' => $production_date,
            'estimation_date' => $estimation_date,
            'finish_date' => $finish_date,
        ])->update();

SELECT *
FROM `productions`
WHERE `admin_id` = '1'
AND `id` = '2'
 LIMIT 1
SELECT *
FROM `costs`
WHERE `production_id` = '2'
 LIMIT 1
SELECT *
FROM `materials`
SELECT *
FROM `products`
SELECT *
FROM `ingredients`
WHERE `production_id` = '2'
---
    public function production_manage($production_id)
    {
        $productionData = $this->ProductionModel->where(['admin_id' => $this->session->admin_id, 'id' => $production_id])->first();
        $cost = $this->costModel->where(['production_id' => $production_id])->first();
        $materials = $this->materialModel->findAll();
        $products = $this->productModel->findAll();
        $ingredients = $this->ingredientModel
            ->where(['production_id' => $production_id])
            ->findAll();

SELECT *
FROM `productions`
WHERE `id` = '8'
 LIMIT 1
SELECT *
FROM `ingredients`
WHERE `production_id` = '8'
SELECT *
FROM `costs`
WHERE `production_id` = '8'
---
    public function production_delete($produciton_id)
    {
        $producitonData = $this->ProductionModel->where('id', $produciton_id)->first();
        if ($producitonData == NULL) {
            $this->session->setFlashdata("msg_type", "error");
            $this->session->setFlashdata("msg", "<b>Gagal</b> <br> Produksi tidak ditemukan.");
            return redirect()->to(base_url('buy'));
        }

        $ingredientData = $this->ingredientModel->where('production_id', $produciton_id)->first();

        $costData = $this->costModel->where('production_id', $produciton_id)->first();

UPDATE `costs` SET `production_id` = '2', `price` = '1000', `date` = '2022-12-31', `details` = '-'
WHERE `id` = '1'
---
    public function cost_edit_process()
    {
        $cost_id = $this->request->getPost('cost_id');
        $production_id = $this->request->getPost('production_id');
        $price = $this->request->getPost('price');
        $date = $this->request->getPost('date');
        $details = $this->request->getPost('details');

        $this->costModel->where('id', $cost_id)->set([
            'production_id' => $production_id,
            'price' => $price,
            'date' => $date,
            'details' => $details,
        ])->update();