app/Controllers/ProductController.php

    public function product()
    {
        $products = $this->productModel->orderBy("name","asc")->findAll();
---
SELECT *
FROM `products`
ORDER BY `name` ASC

    public function product_add_process(){
        $name = $this->request->getPost("name");
        $unit = $this->request->getPost("unit");
        $price = $this->request->getPost("price");
        $stocks = $this->request->getPost("stocks");

        $this->productModel->insert([
            "name" => $name,
            "unit" => $unit,
            "price" => $price,
            "stocks" => $stocks,
        ]);

        $productID = $this->productModel->getInsertID();

        $variant_unit = $this->request->getPost("variant_unit");
        $variant_price = $this->request->getPost("variant_price");
        $quantity_included = $this->request->getPost("quantity_included");

        $variant_unit_count = count($variant_unit) - 1;
        if($variant_unit_count > 0){
            for($v = 0; $v <= $variant_unit_count; $v++){
                if(strlen($variant_unit[$v]) > 0){
                    $this->productVariantModel->insert([
                        "product_id" => $productID,
                        "unit" => $variant_unit[$v],
                        "price" => $variant_price[$v],
                        "quantity_included" => $quantity_included[$v],
                    ]);
---
INSERT INTO `products` (`name`, `unit`, `price`, `stocks`) VALUES ('Air Kemasan', 'Cup', '1500', '5000')
INSERT INTO `product_variants` (`product_id`, `unit`, `price`, `quantity_included`) VALUES (3, 'C', '1', '24')