app/Controllers/ProductionController.php

    public function production_manage($production_id)
    {
        $productionData = $this->ProductionModel->where(['id' => $production_id])->first();
        $costs = $this->costModel->where(['production_id' => $production_id])->findAll();
        $materials = $this->materialModel->findAll();
        $products = $this->productModel->findAll();
---
SELECT *
FROM `materials`
SELECT *
FROM `products`