app/Controllers/SaleController.php

SELECT *
FROM `sales`
WHERE `id` = '1'
AND `admin_id` = '1'
 LIMIT 1
SELECT *
FROM `customers`
ORDER BY `name` ASC
SELECT *
FROM `products`
ORDER BY `name` ASC
SELECT *
FROM `product_variants`
ORDER BY `unit` ASC
---
    public function sale_manage($id)
    {
        $sale = $this->saleModel->where("id", $id)->where("admin_id", $this->session->admin_id)->first();

        if ($sale == NULL) {
            $this->session->setFlashdata("msg_type", "error");
            $this->session->setFlashdata("msg", "<b>Gagal</b> <br> Data pembelian tidak ditemukan.");
            return redirect()->to(base_url('sale'));
        }

        $items = $this->saleItemModel->where("sale_id", $id)->findAll();
        $customers = $this->customerModel->orderBy("name", "asc")->findAll();
        // $products = $this->productVariantModel
        //     ->join('products', 'product_variants.product_id = products.id')
        //     ->select([
        //         'product_variants.id as product_variant_id',
        //         'product_variants.unit as product_variant_unit',
        //         'products.id as product_id',
        //         'products.unit as product_unit',
        //         'products.name as product_name',
        //     ])->findAll();
        $products = $this->productModel->orderBy("name", "asc")->findAll();
        $product_variants = $this->productVariantModel->orderBy("unit", "asc")->findAll();