app/Controllers/SaleController.php

SELECT *
FROM `sales`
WHERE `admin_id` = '1'
ORDER BY `date` DESC, `id` DESC
---
    public function sale()
    {
        $sales = $this->saleModel
            ->where("admin_id", $this->session->admin_id)
            ->orderBy("date", "desc")
            ->orderBy("id", "desc")
            ->findAll();

SELECT *
FROM `sales`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `sale_items`
WHERE `sale_id` = '1'
---
    public function sale_delete($sale_id)
    {
        $data_sale = $this->saleModel->where('id', $sale_id)->first();
        if ($data_sale == NULL) {
            $this->session->setFlashdata("msg_type", "error");
            $this->session->setFlashdata("msg", "<b>Gagal</b> <br> Penjualan tidak ditemukan.");
            return redirect()->to(base_url('sale'));
        }

        $cek_sale_items = $this->saleItemModel->where('sale_id', $sale_id)->findAll();

SELECT *
FROM `sale_items`
WHERE `sale_id` = '2'
SELECT *
FROM `customers`
ORDER BY `name` ASC
SELECT *
FROM `products`
ORDER BY `name` ASC
SELECT *
FROM `product_variants`
ORDER BY `unit` ASC
---
    public function sale_manage($id)
    {
        $sale = $this->saleModel->where("id", $id)->first();

        if ($sale == NULL) {
            $this->session->setFlashdata("msg_type", "error");
            $this->session->setFlashdata("msg", "<b>Gagal</b> <br> Data Penjualan tidak ditemukan.");
            return redirect()->to(base_url('sale'));
        }

        $items = $this->saleItemModel->where("sale_id", $id)->findAll();
        $customers = $this->customerModel->orderBy("name", "asc")->findAll();

        $products = $this->productModel->orderBy("name", "asc")->findAll();
        $product_variants = $this->productVariantModel->orderBy("unit", "asc")->findAll();