app/Controllers/SaleController.php

    public function sale_manage($id)
    {
        $sale = $this->saleModel->where("id", $id)->where("admin_id", $this->session->admin_id)->first();
---
SELECT *
FROM `sales`
WHERE `id` = '2'
AND `admin_id` = '1'
 LIMIT 1