app/Controllers/SupplierController.php

SELECT *
FROM `suppliers`
ORDER BY `name` ASC
---
    public function supplier(){
        $suppliers = $this->supplierModel->orderBy("name","asc")->findAll();