app/Controllers/TransactionController.php

    public function transaction(){
        $transactions = $this->transactionModel->orderBy("date","desc")->orderBy("id","desc")->findAll();
---
SELECT *
FROM `transactions`
ORDER BY `date` DESC, `id` DESC